
#Область ПрограммныйИнтерфейс

// Обработать полученные сообщения.
Процедура ОбработатьПолученныеСообщения() Экспорт
	
 Данные = ПолучитьНеобработанныеСообщенияОбОшибках();
 Если Данные.Количество() > 0  Тогда
	СоздатьДокументыРегистрацияОшибки(Данные);
 КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить необработанные сообщения об ошибках из РС со_СообщенияОбОшибках
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить необработтные сообщения об ошибках
Функция ПолучитьНеобработанныеСообщенияОбОшибках() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ со_СообщенияОбОшибках.ИД,
		|	со_СообщенияОбОшибках.ДатаОшибки,
		|	со_СообщенияОбОшибках.ДанныеОшибки
		|ИЗ
		|	РегистрСведений.со_СообщенияОбОшибках КАК со_СообщенияОбОшибках";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


// Создать документы регистрация ошибки.
// 
// Параметры:
//  Данные - ТаблицаЗначений - Данные
Процедура СоздатьДокументыРегистрацияОшибки(Данные) 

	Для каждого ТекущаяСтрока из Данные Цикл
		СоздатьДокументРегистрацияОшибки(ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры


// Заполнение реквизитов документа на основе данных из регистра сведений
// 
// Параметры:
//  ДанныеДляЗаполнения - СтрокаТаблицыЗначений - Данные для заполнения
Процедура СоздатьДокументРегистрацияОшибки(ДанныеДляЗаполнения) Экспорт

	Временныйфайл  = ПолучитьИмяВременногоФайла(".zip");
	ВременнаяПапка = КаталогВременныхФайлов() + "ОбработкаСообщенийОбОшибках\";
	
	// Получение значения из хранилища значений
	Хранилище = ДанныеДляЗаполнения.ДанныеОшибки.Получить();
	Если Хранилище <> Неопределено Тогда
	// Предполагаем, что в хранилище лежит объект, который можно записать в файл,
	// например, ДвоичныеДанные или строка, содержащая путь к файлу или его содержимое.

		Попытка
			Хранилище.Записать(Временныйфайл);
			ZipФайл = Новый ЧтениеZipФайла(Временныйфайл);
			ZipФайл.ИзвлечьВсе(ВременнаяПапка, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ZipФайл.Закрыть();
			
			ФайлДляРазбора = Новый Файл(ВременнаяПапка + "report.json");
			Если ФайлДляРазбора.Существует() Тогда		
				
				//Выделим только нужную часть файла, сохраним в JSON 
				ФайлJSON = Новый ЧтениеJSON;
				ФайлJSON.ОткрытьФайл(ВременнаяПапка + "report.json","UTF8");
				ДанныеJSON = ПрочитатьJSON(ФайлJSON);
				ФайлJSON.Закрыть();				
				Результат = ПолучитьСвойствоСтруктуры(ДанныеJSON, "errorInfo");
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, Результат);
				КраткийТекстОшибки = ЗаписьJSON.Закрыть();
				
				//Заполним ключевые данные по ошибке
					
				НоваяСсылка = Документы.со_РегистрацияОшибки.ПолучитьСсылку();
				НовыйДокумент = Документы.со_РегистрацияОшибки.СоздатьДокумент();
				НовыйДокумент.УстановитьСсылкуНового(НоваяСсылка);
				СсылкаНаДокумент = НовыйДокумент.ПолучитьСсылкуНового();
				
				ДанныеДляЗаполненияДокумента = ПодготовитьДанныеДляДокумента(ДанныеJSON);
				ЗаполнитьЗначенияСвойств(НовыйДокумент, ДанныеДляЗаполненияДокумента);
				
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.ТекстОшибки  = КраткийТекстОшибки;

				РаботаСФайлами.ДобавитьФайлСДиска(СсылкаНаДокумент,ВременнаяПапка + "report.json");
				ФайлДляПроверки = Новый Файл(ВременнаяПапка + "screenshot.png");
				Если ФайлДляПроверки.Существует() Тогда
					НовыйДокумент.ФайлСкриншота = РаботаСФайлами.ДобавитьФайлСДиска(СсылкаНаДокумент,ВременнаяПапка + "screenshot.png");
				КонецЕсли;				

				НовыйДокумент.Записать();
				
			КонецЕсли;
					
			// Удаление временного файла
			УдалитьФайлы(Временныйфайл);
			УдалитьФайлы(ВременнаяПапка);
			УдалитьЗаписьИЗРегистра(ДанныеДляЗаполнения) ;
		Исключение
				ИмяСобытия = "Документ РегистрацияОшибки. Создание";
				ПредставлениеУровня = УровеньЖурналаРегистрации.Ошибка;   //представление уровня записи - "Информация", "Ошибка", "Предупреждение", "Примечание".
				Комментарий = ОписаниеОшибки(); 
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня, Комментарий,,Истина);	
		КонецПопытки;
	Иначе
				ИмяСобытия = "Документ РегистрацияОшибки. Создание";
				ПредставлениеУровня = УровеньЖурналаРегистрации.Ошибка;   //представление уровня записи - "Информация", "Ошибка", "Предупреждение", "Примечание".
				Комментарий = "Хранилище значений пусто или не содержит данных."; 
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня, Комментарий,,Истина);	
	КонецЕсли;

	
КонецПроцедуры


Функция ПолучитьСвойствоСтруктуры(ДанныеСтруктура, ИмяСвойства)
	
	Результат = Неопределено;
	
	Если ТипЗНЧ(ДанныеСтруктура) = Тип("Структура") тогда
    	ДанныеСтруктура.Свойство(ИмяСвойства, Результат);	
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции


Функция ПодготовитьДанныеДляДокумента(ДанныеJSON)

    Результат = Новый Структура();
 
	Результат.Вставить("Дата",ТекущаяДата());
	Результат.Вставить("ТекстОшибки", "");
	
	Данные = ПолучитьСвойствоСтруктуры(ДанныеJSON, "sessionInfo");
	Результат.Вставить("Пользователь",    ПолучитьСвойствоСтруктуры(Данные, "userName"));
	
	Данные = ПолучитьСвойствоСтруктуры(ДанныеJSON, "serverInfo");
	Результат.Вставить("ИБ", 		      ПолучитьСвойствоСтруктуры(Данные,  "dbms"));
	Результат.Вставить("ВерсияПлатформы", ПолучитьСвойствоСтруктуры(Данные,  "appVersion"));

	Данные = ПолучитьСвойствоСтруктуры(ДанныеJSON, "configInfo");
	Результат.Вставить("ВерсияКонфигурации",          ПолучитьСвойствоСтруктуры(Данные,  "version"));
	Результат.Вставить("НаименованиеКонфигурации",    ПолучитьСвойствоСтруктуры(Данные,  "name"));
	
	Результат.Вставить("ДатаОшибки",     ПрочитатьДатуJSON( ПолучитьСвойствоСтруктуры(ДанныеJSON, "time"), ФорматДатыJSON.ISO));
	Результат.Вставить("Дополнительно",   ПолучитьСвойствоСтруктуры(ДанныеJSON, "additionalInfo"));
	
Возврат Результат;
	
КонецФункции


Процедура УдалитьЗаписьИЗРегистра(ДанныеЗаписи)

	Запись = РегистрыСведений.со_СообщенияОбОшибках.СоздатьМенеджерЗаписи();
	Запись.ИД = ДанныеЗаписи.ИД;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
	
		Запись.Удалить();
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
