
#Область ПрограммныйИнтерфейс

// Обработать полученные сообщения.
Процедура ОбработатьПолученныеСообщения() Экспорт
	
 Данные = ПолучитьНеобработанныеСообщенияОбОшибках();
 Если Данные.Количество() > 0  Тогда
	СоздатьДокументыРегистрацияОшибки(Данные);
 КонецЕсли;
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


// Получить необработанные сообщения об ошибках из РС со_СообщенияОбОшибках
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить необработтные сообщения об ошибках
Функция ПолучитьНеобработанныеСообщенияОбОшибках() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	со_СообщенияОбОшибках.ДатаОшибки,
		|	со_СообщенияОбОшибках.ДанныеОшибки
		|ИЗ
		|	РегистрСведений.со_СообщенияОбОшибках КАК со_СообщенияОбОшибках";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции


// Создать документы регистрация ошибки.
// 
// Параметры:
//  Данные - ТаблицаЗначений - Данные
Процедура СоздатьДокументыРегистрацияОшибки(Данные) 

	Для каждого ТекущаяСтрока из Данные Цикл
		СоздатьДокументРегистрацияОшибки(ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры


// Заполнение реквизитов документа на основе данных из регистра сведений
Процедура СоздатьДокументРегистрацияОшибки(ДанныеДляЗаполнения) Экспорт

	Временныйфайл  = ПолучитьИмяВременногоФайла(".zip");
	ВременнаяПапка = КаталогВременныхФайлов() + "ОбработкаСообщенийОбОшибках\";
	
	// Получение значения из хранилища значений
	Хранилище = ДанныеДляЗаполнения.ДанныеОшибки.Получить();
	Если Хранилище <> Неопределено Тогда
	// Предполагаем, что в хранилище лежит объект, который можно записать в файл,
	// например, ДвоичныеДанные или строка, содержащая путь к файлу или его содержимое.

		Попытка
			Хранилище.Записать(Временныйфайл);
			ZipФайл = Новый ЧтениеZipФайла(Временныйфайл);
			ZipФайл.ИзвлечьВсе(ВременнаяПапка, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ZipФайл.Закрыть();
			
			ФайлДляРазбора = Новый Файл(ВременнаяПапка + "report.json");
			Если ФайлДляРазбора.Существует() Тогда
				
			//	ЧтениеJSON.Прочитать()
				
				Данные = Новый ТекстовыйДокумент;
				Данные.Прочитать(ВременнаяПапка + "report.json", КодировкаТекста.UTF8);
				ПолныйТекстОшибки = Данные.ПолучитьТекст();
				
				НоваяСсылка = Документы.со_РегистрацияОшибки.ПолучитьСсылку();
				НовыйДокумент = Документы.со_РегистрацияОшибки.СоздатьДокумент();
				НовыйДокумент.УстановитьСсылкуНового(НоваяСсылка);
				СсылкаНаДокумент = НовыйДокумент.ПолучитьСсылкуНового();
				
				
				НовыйДокумент.Дата = ТекущаяДата();
				НовыйДокумент.ТекстОшибки  = ПолныйТекстОшибки;
				НовыйДокумент.Пользователь = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "userName");
				НовыйДокумент.ИБ 		   = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "dbms");
				НовыйДокумент.ДатаОшибки   = ПрочитатьДатуJSON(ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "time"), ФорматДатыJSON.ISO);
				НовыйДокумент.Дополнительно   = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "additionalInfo");
				НовыйДокумент.ВерсияПлатформы = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "appVersion");
				НовыйДокумент.ВерсияКонфигурации         = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, """version");
				НовыйДокумент.НаименованиеКонфигурации   = ПолучитьРеквизитОшибки(ПолныйТекстОшибки, "name");

				РаботаСФайлами.ДобавитьФайлСДиска(СсылкаНаДокумент,ВременнаяПапка + "report.json");
				ФайлДляПроверки = Новый Файл(ВременнаяПапка + "screenshot.png");
				Если ФайлДляПроверки.Существует() Тогда
					НовыйДокумент.ФайлСкриншота = РаботаСФайлами.ДобавитьФайлСДиска(СсылкаНаДокумент,ВременнаяПапка + "screenshot.png");
				КонецЕсли;				

				НовыйДокумент.Записать();
				
			КонецЕсли;
					
			// Удаление временного файла
			УдалитьФайлы(Временныйфайл);
			УдалитьФайлы(ВременнаяПапка);
		Исключение
				ИмяСобытия = "Документ РегистрацияОшибки. Создание";
				ПредставлениеУровня = "Ошибка";   //представление уровня записи - "Информация", "Ошибка", "Предупреждение", "Примечание".
				Комментарий = ОписаниеОшибки(); 
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня, Комментарий,,Истина);	
		КонецПопытки;
	Иначе
				ИмяСобытия = "Документ РегистрацияОшибки. Создание";
				ПредставлениеУровня = "Ошибка";   //представление уровня записи - "Информация", "Ошибка", "Предупреждение", "Примечание".
				Комментарий = "Хранилище значений пусто или не содержит данных."; 
				ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня, Комментарий,,Истина);	
	КонецЕсли;

	
КонецПроцедуры


// Получить реквизит ошибки прочитанный из файла report.json
//
// Параметры:
//  ТекстОшибки - Строка - Текст ошибки из файла report.json	
//  ИмяРевизита - Строка - Имя реквизита
// 
// Возвращаемое значение:
//  Строка - Реквизит ошибки
//
Функция ПолучитьРеквизитОшибки(ТекстОшибки, ИмяРевизита)
	
	
	Поз = СтрНайти(ТекстОшибки, ИмяРевизита,);
	Если Поз = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Поз = Поз + СтрДлина(ИмяРевизита) + 4;
	Поз1 = СтрНайти(ТекстОшибки, """",, Поз);
	Если Поз1 = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат Сред(ТекстОшибки, Поз, Поз1 - Поз);

КонецФункции

#КонецОбласти
