
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Записывает сообщение об ошибке в регистр сведений
//
// Параметры:
//  Данные 		  - ХранилищеЗначения	    - Данные об ошибке
//  Идентификатор - УникальныйИдентификатор - Идентификатор ошибки
//
Процедура ЗаписатьСообщениеОбОшибках(Данные, Идентификатор = Неопределено) Экспорт
	
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.ИД = ?(Идентификатор = Неопределено, Новый УникальныйИдентификатор, Идентификатор);
	НоваяЗапись.ДанныеОшибки = Данные;
	НоваяЗапись.ДатаОшибки = ТекущаяДатаСеанса();
	НоваяЗапись.Записать();


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
