#Область ОбработчикиСобытий
Функция ПолучитьЗапросОбОшибке(Запрос)
	
ДанныеОтвета = Новый Структура;
ДанныеОтвета.Вставить("needSendReport", Истина); // Булево значение
ДанныеОтвета.Вставить("dumpPype", 1); 
ДанныеОтвета.Вставить("userMessage", "Мы скоро это исправим");

Ответ = Новый HTTPСервисОтвет(200);
Ответ.УстановитьТелоИзСтроки(ЗначениеВСтрокуJSON(ДанныеОтвета));
	Возврат Ответ;
КонецФункции

Функция ПолучитьИнформациюОбОшибке(Запрос)
	
	ДанныеЗаписи = Запрос.ПолучитьТелоКакДвоичныеДанные();
	Данные = Новый ХранилищеЗначения(ДанныеЗаписи);
	
	РегистрыСведений.со_СообщенияОбОшибках.ЗаписатьСообщениеОбОшибках(Данные);
		
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ЗначениеВСтрокуJSON(Значение)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция СтрокуВЗначениеJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
КонецФункции

#КонецОбласти
